Oleksii742/stm/GSM/Core/Src/ESP8266DRV07.c
#include "string.h"
#include "ESP8266DRV07.h"
#include "stdlib.h"
#include "main.h"
#include "stdio.h"
#include "time.h"
#include "DRV_CFG.h"
//#include "ESP8266WEB.h"
//#include "Mod_Bus.h"
//#include "MAX7219.h"

#define OK  "OK"


char     ESP8266_BUF      [ESP8266_BUF_SIZE] = {0};

char*    READ_BUFFER = 0;
uint16_t WIFI_READ_COUNT   = 0;
uint16_t READ_BUF_SIZE     = 0;
uint16_t WIFI_BUF_SIZE     = 0;
uint8_t WIFI_MODE = 0;

char     Self_IP          [17] = {0};
char     CMD_temp         [CMD_temp_SIZE] = {0};
char     CMD_temp_temp    [CMD_temp_temp_SIZE] = {0};
uint8_t  ERR              [15] = {0};

uint8_t                   DMA_TC = 0;
int8_t                    GLOBAL_RETURN = 0;
int                       RSSI_Power = 0;
char WIFI_ID[5]   =       {'\0'};
char *WIFI_WEB_ID =       WIFI_ID;

TypeDef tm;


const char AT[] =                     "AT\r\n";
const char CIFSR[] =                  "AT+CIFSR\r\n";
const char RESTORE[] =                "AT+RESTORE\r\n";
const char STA[] = 					  "AT+CWMODE_CUR=1\r\n";
const char AP[] = 					  "AT+CWMODE_CUR=2\r\n";
const char AP_STA[] = 				  "AT+CWMODE_CUR=3\r\n";
const char CIP_ON[] = 				  "AT+CIPMODE=1\r\n";
const char CIP_OFF[] = 				  "AT+CIPMODE=0\r\n";
const char MUX_ON[] = 				  "AT+CIPMUX=1\r\n";
const char MUX_OFF[] = 				  "AT+CIPMUX=0\r\n";
const char STAON[] = 				  "AT+CWDHCP_CUR=1,1\r\n";
const char APON[] = 				  "AT+CWDHCP_CUR=0,1\r\n";
const char APSTAON[] = 				  "AT+CWDHCP_CUR=2,1\r\n";
const char STAOFF[] = 				  "AT+CWDHCP_CUR=1,0\r\n";
const char APOFF[] = 				  "AT+CWDHCP_CUR=0,0\r\n";
const char APSTAOFF[] = 			  "AT+CWDHCP_CUR=2,0\r\n";
const char APNAME[] =                 "AT+CWSAP_CUR=";
const char NTP[] = 					  "AT+CIPSNTPCFG=1,2,\"0.ua.pool.ntp.org\",\"1.ua.pool.ntp.org\",\"2.ua.pool.ntp.org\"\r\n";
const char ASK_CWJAP_CUR[] = 		  "AT+CWJAP_CUR?\r\n";
const char CLOSE[] =				  "AT+CIPCLOSE=";


void ESP8266_USART_CALLBACK()
{
	ESP8266_BUF[WIFI_READ_COUNT] = LL_USART_ReceiveData8(ESP8266_USART);

   if(WIFI_READ_COUNT < ESP8266_BUF_SIZE)
    {
     WIFI_READ_COUNT++;
    }
}

void USART_DMA_ACTIVE()
{
  LL_USART_EnableIT_RXNE(USART1);
  LL_USART_EnableDMAReq_TX(USART1);
  LL_DMA_EnableIT_TC(DMA1, LL_DMA_CHANNEL_4);
}

void USART_DMA_TC_CALLBACK()
{
 if(ESP8266_DMA_ACTIVE_TC_FLAG(ESP8266_DMA))
  {
	ESP8266_DMA_CLEAR_TC_FLAG(ESP8266_DMA);
	DMA_TC = SET;
  }
}

uint8_t ESP8266_DMA_send(const char* temp,int len,const char* answer,const char* from, uint16_t count)//++++
{
	uint32_t i;

	LL_DMA_DisableChannel(ESP8266_DMA, ESP8266_DMA_CHANEL);
	LL_DMA_ConfigAddresses(ESP8266_DMA, ESP8266_DMA_CHANEL, (uint32_t)temp, LL_USART_DMA_GetRegAddr(ESP8266_USART), LL_DMA_DIRECTION_MEMORY_TO_PERIPH);
	LL_DMA_SetDataLength(ESP8266_DMA, ESP8266_DMA_CHANEL, len);
	LL_DMA_EnableChannel(ESP8266_DMA, ESP8266_DMA_CHANEL);

	while(DMA_TC != 1){};

    for(i=0; i < count; i+=5)
     {
      HAL_Delay(5);

      if(strstr(from,answer) != 0)
       {
    	i = count;
    	GLOBAL_RETURN = 0;
       }
     }

    if(strstr(from,answer) == 0)
     {
    	GLOBAL_RETURN = 1;
     }

      DMA_TC = 0;

	  return GLOBAL_RETURN;
}

void BUF_clear(char* BUF, char DAT, uint16_t size)
{
  memset(BUF,DAT,size);
  WIFI_READ_COUNT = 0;
}


/////////////////////////////////////////////////////ESP_SYS////////////////////////////////////////////

#ifdef ENABLE
void WIFI_ENABLE()
{
	HAL_GPIO_WritePin(ESP8266_ENABLE_PORT, ESP8266_ENABLE_PIN, GPIO_PIN_SET);
	HAL_Delay(500);
}
#endif

#ifdef RESET
void WIFI_RESET_HARD(int time)
{
	uint8_t i = 0;

	HAL_GPIO_WritePin(ESP8266_RESET_PORT, ESP8266_RESET_PIN, GPIO_PIN_SET);
	HAL_Delay(50);
	HAL_GPIO_WritePin(ESP8266_RESET_PORT, ESP8266_RESET_PIN, GPIO_PIN_RESET);
	HAL_Delay(100);
	HAL_GPIO_WritePin(ESP8266_RESET_PORT, ESP8266_RESET_PIN, GPIO_PIN_SET);

	while(i != 1)
	 {
	  HAL_Delay(500);
	  BUF_clear(ESP8266_BUF,0,ESP8266_BUF_SIZE);

	  if(ESP_AT() == 0)
	   {
		i = 1;
	   }
	 }
}
#endif

uint8_t ESP_AT()
{
  GLOBAL_RETURN = ESP8266_DMA_send(AT,4,OK,ESP8266_BUF,2000);

  BUF_clear(ESP8266_BUF,0,ESP8266_BUF_SIZE);

  return GLOBAL_RETURN;
}

uint8_t ESP_WIFI_MODE_SET(uint8_t dat, uint32_t count)//++
{
	char* CMD = 0;

    switch(dat)
	 {
	  case 1:
	   CMD = (char*)AP;//memcpy(CMD_temp,AP,strlen(AP));
	  break;

	  case 2:
	   CMD = (char*)STA;//memcpy(CMD_temp,STA,strlen(STA));
	  break;

	  case 3:
	   CMD = (char*)AP_STA;//memcpy(CMD_temp,AP_STA,strlen(AP_STA));
	  break;
	 }

    GLOBAL_RETURN = ESP8266_DMA_send(CMD,strlen(CMD),OK, ESP8266_BUF,count);

    BUF_clear(ESP8266_BUF,0,ESP8266_BUF_SIZE);

	return GLOBAL_RETURN;
}

uint8_t DHCP_ONOFF(uint8_t DHCP,uint32_t count)//++
{
	char* CMD = 0;

    switch(DHCP)
    {
     case 1:
      CMD = (char*)APON;//memcpy(CMD_temp,APON,strlen(APON));
     break;

     case 2:
      CMD = (char*)APOFF;//memcpy(CMD_temp,APOFF,strlen(APOFF));
     break;

     case 3:
      CMD = (char*)STAON;//memcpy(CMD_temp,STAON,strlen(STAON));
     break;

     case 4:
      CMD = (char*)STAOFF;//memcpy(CMD_temp,STAOFF,strlen(STAOFF));
     break;

     case 5:
      CMD = (char*)APSTAON;//memcpy(CMD_temp,APSTAON,strlen(APSTAON));
     break;

     case 6:
      CMD = (char*)APSTAOFF;//memcpy(CMD_temp,APSTAOFF,strlen(APSTAOFF));
     break;
    }

    GLOBAL_RETURN = ESP8266_DMA_send(CMD,strlen(CMD),OK,ESP8266_BUF,count);

    BUF_clear(ESP8266_BUF,0,ESP8266_BUF_SIZE);

	return GLOBAL_RETURN;
}

uint8_t WIFI_CIP(uint8_t mode, uint32_t count)//++
{
	char* CMD = 0;

	switch(mode)
	{
	 case 1:
	  CMD = (char*)CIP_ON;
	 break;

	 case 2:
	  CMD = (char*)CIP_OFF;
	 break;
	}

	GLOBAL_RETURN = ESP8266_DMA_send(CMD,strlen(CMD),OK, ESP8266_BUF,count);

    BUF_clear(ESP8266_BUF,0,ESP8266_BUF_SIZE);

	return GLOBAL_RETURN;
}

uint8_t ESP_MUX(uint8_t data, uint32_t count)//++
{
	char* CMD = 0;

	switch(data)
	{
	 case 1:
	  CMD = (char*)MUX_ON;//memcpy(CMD,MUX_ON,strlen(MUX_ON));
	 break;

	 case 2:
	  CMD = (char*)MUX_OFF;//memcpy(CMD,MUX_OFF,strlen(MUX_OFF));
	 break;
	}

	GLOBAL_RETURN = ESP8266_DMA_send(CMD,strlen(CMD),OK,ESP8266_BUF,count);


    BUF_clear(ESP8266_BUF,0,ESP8266_BUF_SIZE);

	return GLOBAL_RETURN;
}

uint8_t ESP_STA_IP(const char* IP, const char* GATEWAY, const char* MASK,uint16_t timing)//++
{
	strcat(CMD_temp,"AT+CIPSTA_CUR=");
	strcat(CMD_temp,"\"");
	strcat(CMD_temp,IP);
	strcat(CMD_temp,"\",\"");
	strcat(CMD_temp,GATEWAY);
	strcat(CMD_temp,"\",\"");
	strcat(CMD_temp,MASK);
	strcat(CMD_temp,"\"");
	strcat(CMD_temp,"\r\n");

	if(ESP8266_send(CMD_temp,strlen(CMD_temp),"OK",READ_BUFFER,timing) == 0)
	 {
      GLOBAL_RETURN = 0;
     }
    else
     {
      GLOBAL_RETURN = 1;
     }

    BUF_clear(READ_BUFFER,'*',READ_BUF_SIZE);
    BUF_clear(CMD_temp,0,CMD_temp_SIZE);

    return GLOBAL_RETURN;
}

