Oleksii742/stm/GSM/Core/Src/ESP8266DRV07.c
uint8_t ESP_SERVER_ON(const char* port, uint32_t count)//++
{
	char CMD[50] = {0};

	strcat(CMD,"AT+CIPSERVER=1,");
	strcat(CMD,port);
	strcat(CMD,"\r\n");

	GLOBAL_RETURN = ESP8266_DMA_send(CMD,strlen(CMD),OK,ESP8266_BUF,count);

    BUF_clear(ESP8266_BUF,0,ESP8266_BUF_SIZE);

    return GLOBAL_RETURN;
}

uint8_t CIPCLOSE(char temp[])
{
	memcpy(CMD_temp,CLOSE,12);
	strcat(CMD_temp + strlen(CLOSE),temp);
	strcat(CMD_temp,"\r\n");

	GLOBAL_RETURN = ESP8266_DMA_send(CMD_temp,strlen(CMD_temp),OK,ESP8266_BUF,2000);

    BUF_clear(ESP8266_BUF,0,ESP8266_BUF_SIZE);
    BUF_clear(CMD_temp,0,CMD_temp_SIZE);

	return GLOBAL_RETURN;
}

uint8_t WIFI_STA_init(uint8_t MODE, uint8_t DHCP, uint8_t CIP, uint8_t MUX, const char* SERVER_PORT, uint16_t timing)
{
	uint8_t x[5];
	memset(x,'*',5);

	WIFI_RESET_HARD(1000);
    x[0] = ESP_WIFI_MODE_SET(MODE,timing);
    x[1] = DHCP_ONOFF(DHCP,timing);
    x[2] = WIFI_CIP(CIP,timing);
    x[3] = ESP_MUX(MUX,timing);
    x[4] = ESP_SERVER_ON(SERVER_PORT,timing);

    return 0;
}

uint8_t WIFI_APSTA_init(uint8_t MODE, uint8_t DHCP, uint8_t CIP, uint8_t MUX, const char* SERVER_PORT, uint16_t timing)//++
{
    WIFI_status.WIFI_mode = ESP_WIFI_MODE_SET(MODE,timing);         //WIFI MODE
    ESP8266_HOSTNAME(Seting.HOSTNAME);                              //WIFI HOSTNAME

	while(WIFI_status.WIFI_mode == 1)
	 {
	  ERR[3] = 1;
	 }

	////////////////////////////////////////////////////////
    WIFI_status.WIFI_dhcp = DHCP_ONOFF(DHCP,timing);                //WIFI DHCP

	while(WIFI_status.WIFI_dhcp == 1)
	 {
	   ERR[4] = 1;
	 }

	////////////////////////////////////////////////////////
    WIFI_status.WIFI_cip = WIFI_CIP(CIP,timing);//WIFI

	while(WIFI_status.WIFI_cip == 1)
	 {
	   ERR[5] = 1;
	 }

	////////////////////////////////////////////////////////
    WIFI_status.WIFI_ap_name = ESP_AP_NAME(Seting.AP_NAME,Seting.AP_PASS,timing);

	while(WIFI_status.WIFI_ap_name == 1)
	 {
	   ERR[6] = 1;
	 }

	////////////////////////////////////////////////////////
    WIFI_status.WIFI_ap_ip = ESP_AP_IP("1.2.3.4",timing);

	while(WIFI_status.WIFI_ap_ip == 1)
	 {
	   ERR[7] = 1;
	 }

	////////////////////////////////////////////////////////
    WIFI_status.WIFI_mux = ESP_MUX(MUX,timing);

    while(WIFI_status.WIFI_mux == 1)
	 {
	   ERR[7] = 1;
	 }

	////////////////////////////////////////////////////////
    WIFI_status.WIFI_server = ESP_SERVER_ON(SERVER_PORT,timing);

    while(WIFI_status.WIFI_server == 1)
	 {
	   ERR[8] = 1;
	 }

	////////////////////////////////////////////////////////
    //WIFI_status.WIFI_auto_connect = WIFI_AUTOCONNECT("1");
   //WIFI_status.WIFI_START_CONNECTING = WIFI_CONNECT_CUR(Seting.Network,Seting.Password,10000);
    //delay_ms(1000);

    return 0;
}

uint8_t WIFI_AP_init(uint8_t MODE, uint8_t DHCP, uint8_t CIP, uint8_t MUX, const char* SERVER_PORT, uint16_t timing)//++
{
    WIFI_status.WIFI_mode = ESP_WIFI_MODE_SET(MODE,timing);
    ESP8266_HOSTNAME(Seting.HOSTNAME);
    WIFI_status.WIFI_dhcp = DHCP_ONOFF(DHCP,timing);
    WIFI_status.WIFI_cip = WIFI_CIP(CIP,timing);
    WIFI_status.WIFI_ap_name = ESP_AP_NAME(Seting.AP_NAME,Seting.AP_PASS,timing);
    WIFI_status.WIFI_mux = ESP_MUX(MUX,timing);
    WIFI_status.WIFI_server = ESP_SERVER_ON(SERVER_PORT,timing);

    return 0;
}

uint8_t ESP_AP_NAME(char data[],char temp[],uint32_t count)
{
	char CMD[60] = {0};

	strcat(CMD,APNAME);
	strcat(CMD,"\"");
	strcat(CMD,data);
	strcat(CMD,"\",\"");
	strcat(CMD,temp);
	strcat(CMD,"\",");
	strcat(CMD,"10,4\r\n");

	GLOBAL_RETURN = ESP8266_DMA_send(CMD,strlen(CMD),OK,ESP8266_BUF,count);

    BUF_clear(ESP8266_BUF,0,ESP8266_BUF_SIZE);

	return GLOBAL_RETURN;
}

uint8_t ESP_AP_IP(char temp[],uint32_t count)//!!
{
	    char AP_name[] = "AT+CIPAP_CUR=";
		strcat(CMD_temp,AP_name);
		strcat(CMD_temp,"\"");
		strcat(CMD_temp,temp);
		strcat(CMD_temp,"\"");
		strcat(CMD_temp,"\r\n");

		if(ESP8266_DMA_send(CMD_temp,strlen(CMD_temp),OK,ESP8266_BUF,count)==0)
		 {
			GLOBAL_RETURN = 0;
	     }
	    else
	     {
	    	GLOBAL_RETURN = 1;
	     }

	    BUF_clear(ESP8266_BUF,'*',1024);
	    BUF_clear(CMD_temp,0,50);

		return GLOBAL_RETURN;
}

uint8_t ESP_FACTORY_RESET()
{
	uint8_t i = 0;

	GLOBAL_RETURN = ESP8266_DMA_send(RESTORE,strlen(RESTORE),OK, ESP8266_BUF,2000);

	while(i != 1)
	 {
      HAL_Delay(500);
      BUF_clear(ESP8266_BUF,0,ESP8266_BUF_SIZE);

      if(ESP_AT() == 0)
       {
    	i = 1;
       }
	 }

	BUF_clear(ESP8266_BUF,0,ESP8266_BUF_SIZE);

	return GLOBAL_RETURN;
}

/////////////////////////////////////////////////////END_ESP_SYS////////////////////////////////////////


/////////////////////////////////////////////////////ESP_UDP////////////////////////////////////////////

uint8_t CONNECT_TO_UDP(const char* ADDR, const char* PORT, const char* ID, const char* PORT_2, uint16_t timing)//!!
{
	strcat(CMD_temp,"AT+CIPSTART=");
	strcat(CMD_temp,ID);
	strcat(CMD_temp,",\"");
	strcat(CMD_temp,"UDP");//UDP
	strcat(CMD_temp,"\"");
	strcat(CMD_temp,",\"");
	strcat(CMD_temp,ADDR);
	strcat(CMD_temp,"\",");
	strcat(CMD_temp,PORT);
	strcat(CMD_temp,",");
	strcat(CMD_temp,PORT_2);
	strcat(CMD_temp,",");
	strcat(CMD_temp,"0");
	strcat(CMD_temp,"\r\n");

	  if(ESP8266_send(CMD_temp,strlen(CMD_temp),OK, ESP8266_BUF,timing) == 0)
       {
		  WIFI_status.WIFI_CONNECTED_TO_TCP = 1;
		  GLOBAL_RETURN = 0;
       }
      else
       {
    	  WIFI_status.WIFI_CONNECTED_TO_TCP = 0;
    	  GLOBAL_RETURN = 1;
       }

	    BUF_clear(ESP8266_BUF,'*',1024);
	    BUF_clear(CMD_temp,0,50);

	return GLOBAL_RETURN;
}

uint8_t WIFI_SEND_TO_UDP(const char* IP, const char* port, const char* dat, const char* Answer, char *Link)//!!
{
	if(WIFI_status.WIFI_CONNECTED_TO_SSID == 1)
	 {
	     char ito_temp[4] = {0};

	     BUF_clear(ESP8266_BUF,0,ESP8266_BUF_SIZE);

	     memset(ito_temp,0,4);
	     itoa(sizeof(dat),ito_temp,10);
	     memcpy(CMD_temp,"AT+CIPSEND=",11);
	     memcpy(CMD_temp+11,Link,1);
	  	 memcpy(CMD_temp+12,",",1);
	  	 memcpy(CMD_temp+13,ito_temp,strlen(ito_temp));
	  	 strcpy(CMD_temp+15,"\r\n");

	     ESP8266_DMA_send(CMD_temp,strlen(CMD_temp),">",ESP8266_BUF,2000);
	     HAL_Delay(2);
	     BUF_clear(ESP8266_BUF,0,ESP8266_BUF_SIZE);
	     HAL_Delay(2);
	     ESP8266_DMA_send((char*)dat,strlen(dat),"SEND OK",ESP8266_BUF,2000);
	 }

    BUF_clear(ESP8266_BUF,0,ESP8266_BUF_SIZE);
    BUF_clear(CMD_temp,0,CMD_temp_SIZE);

