Oleksii742/stm/GSM/Core/Src/ESP8266DRV07.c
     return 0;
}

uint8_t WIFI_Setting_UDP()
{
	WIFI_APSTA_init(MODE_APSTA, DHCP_APSTA_ON, WIFI_CIP_OFF, WIFI_MUX_ON, "80", 5000);

	if((WIFI_status.WIFI_mode + WIFI_status.WIFI_dhcp + WIFI_status.WIFI_cip + WIFI_status.WIFI_ap_name + WIFI_status.WIFI_ap_ip + WIFI_status.WIFI_mux + WIFI_status.WIFI_server) == 0)
	 {
		GLOBAL_RETURN = 0;
	 }
	else
	 {
		GLOBAL_RETURN = 1;
	 }

	return GLOBAL_RETURN;
}

/////////////////////////////////////////////////////END_ESP_UDP///////////////////////////////////////


/////////////////////////////////////////////////////ESP_TCP///////////////////////////////////////////

uint8_t WIFI_SEND_TO_TCP(const char* IP, const char* port, const char* dat, const char* Answer, char *Link)//!!
{
	if(WIFI_status.WIFI_CONNECTED_TO_SSID == 1)
	 {
	  CONNECT_TO_TCP(IP,port,Link,2000);

	  if(WIFI_status.WIFI_CONNECTED_TO_TCP == 1)
	   {
	     char ito_temp[4] = {0};

	     BUF_clear(ESP8266_BUF,'*',1024);

	     memset(ito_temp,0,4);
	     itoa(strlen(dat),ito_temp,10);
	     memcpy(CMD_temp,"AT+CIPSEND=",11);
	     memcpy(CMD_temp+11,Link,1);
	  	 memcpy(CMD_temp+12,",",1);
	  	 memcpy(CMD_temp+13,ito_temp,strlen(ito_temp));
	  	 strcpy(CMD_temp+14,"\r\n");

	     ESP8266_DMA_send(CMD_temp,strlen(CMD_temp),">",ESP8266_BUF,2000);

	     BUF_clear(ESP8266_BUF,'*',1024);

	     ESP8266_DMA_send((char*)dat,strlen(dat),"SEND OK",ESP8266_BUF,2000);

	     CIPCLOSE(Link);
	   }

	 }

    BUF_clear(ESP8266_BUF,'*',1024);
    BUF_clear(CMD_temp,0,50);
     return 0;
}

int8_t CONNECT_TO_TCP(const char* ADDR, const char* PORT, const char* ID, uint16_t timing)//!!
{
	strcat(CMD_temp,"AT+CIPSTART=");
	strcat(CMD_temp,ID);
	strcat(CMD_temp,",\"");
	strcat(CMD_temp,"TCP");//UDP
	strcat(CMD_temp,"\"");
	strcat(CMD_temp,",\"");
	strcat(CMD_temp,ADDR);
	strcat(CMD_temp,"\",");
	strcat(CMD_temp,PORT);
	strcat(CMD_temp,",");
	strcat(CMD_temp,"0");
	strcat(CMD_temp,"\r\n");

	  if(ESP8266_DMA_send(CMD_temp,strlen(CMD_temp),OK,ESP8266_BUF,5000) == 0)
       {
		  WIFI_status.WIFI_CONNECTED_TO_TCP = 1;
		  GLOBAL_RETURN = 0;
       }
      else
       {
    	  WIFI_status.WIFI_CONNECTED_TO_TCP = 0;
    	  GLOBAL_RETURN = 1;
       }

	    BUF_clear(ESP8266_BUF,'*',1024);
	    BUF_clear(CMD_temp,0,50);

	return GLOBAL_RETURN;
}

uint8_t WIFI_Setting_TCP()
{
	WIFI_APSTA_init(MODE_APSTA, DHCP_APSTA_ON, WIFI_CIP_OFF, WIFI_MUX_ON, "80", 5000);

	if((WIFI_status.WIFI_mode + WIFI_status.WIFI_dhcp + WIFI_status.WIFI_cip + WIFI_status.WIFI_ap_name + WIFI_status.WIFI_ap_ip + WIFI_status.WIFI_mux + WIFI_status.WIFI_server) == 0)
	 {
		GLOBAL_RETURN = 0;
	 }
	else
	 {
		GLOBAL_RETURN = 1;
	 }

	return GLOBAL_RETURN;
}

/////////////////////////////////////////////////////END_ESP_TCP///////////////////////////////////////


/////////////////////////////////////////////////////ESP_WIFI//////////////////////////////////////////

int8_t WIFI_CONNECT_CUR(const char* SSID, const char* PASS, uint16_t timing)//!!
{
  if(WIFI_status.WIFI_CONNECTED_TO_SSID == 0)
   {
	  //BUF_clear(ESP8266_BUF,0,ESP8266_BUF_SIZE);

      //char* temp;
      //uint8_t i = 0;
	  strcat(CMD_temp,"AT+CWJAP_CUR=");
	  strcat(CMD_temp,"\"");
	  strcat(CMD_temp,SSID);
	  strcat(CMD_temp,"\",\"");
	  strcat(CMD_temp,PASS);
	  strcat(CMD_temp,"\"");
	  strcat(CMD_temp,"\r\n");


	  if(ESP8266_DMA_send(CMD_temp,strlen(CMD_temp),OK,(char*)ESP8266_BUF,timing) == 0)
       {
	    GLOBAL_RETURN = 0;

	    BUF_clear(ESP8266_BUF,0,ESP8266_BUF_SIZE);

	    WIFI_status.WIFI_CONNECTED_TO_SSID = 1;
	    READ_WIFI_CONNECTION(Seting.Network,2000);

	    ESP8266_DMA_send((char*)CIFSR,strlen(CIFSR),OK,(char*)ESP8266_BUF,2000);

	    char* temp_start = strstr((char*)ESP8266_BUF,"\"")+1;
	    char* temp_end   = strstr(temp_start,"\"");
	    memcpy(Self_IP,temp_start,temp_end - temp_start);
     }
	else
	 {
	  GLOBAL_RETURN = 1;
	  WIFI_status.WIFI_CONNECTED_TO_SSID = 0;
	 }

  }

  BUF_clear(ESP8266_BUF,0,ESP8266_BUF_SIZE);
  BUF_clear(CMD_temp,0,CMD_temp_SIZE);

	return GLOBAL_RETURN;
}

uint8_t WIFI_CONNECT_DEF(const char* SSID, const char* PASS, uint16_t timing)//!!
{
	if(WIFI_status.WIFI_CONNECTED_TO_SSID == 0)
	   {
		WIFI_READ_ALL_SSID(ESP8266_BUF,5000);

		if(strstr((char*)ESP8266_BUF,Seting.Network) != 0)
		 {
		  BUF_clear(ESP8266_BUF,0,ESP8266_BUF_SIZE);

	      char* temp;
	      uint8_t i = 0;
		  strcat(CMD_temp,"AT+CWJAP_DEF=");
		  strcat(CMD_temp,"\"");
		  strcat(CMD_temp,SSID);
		  strcat(CMD_temp,"\",\"");
		  strcat(CMD_temp,PASS);
		  strcat(CMD_temp,"\"");
		  strcat(CMD_temp,"\r\n");


		  if(ESP8266_DMA_send(CMD_temp,strlen(CMD_temp),OK,(char*)ESP8266_BUF,timing) == 0)
	       {
		    GLOBAL_RETURN = 0;

		    BUF_clear(ESP8266_BUF,0,ESP8266_BUF_SIZE);

		    WIFI_status.WIFI_CONNECTED_TO_SSID = 1;
		    READ_WIFI_CONNECTION(Seting.Network,2000);

		    ESP8266_DMA_send((char*)CIFSR,strlen(CIFSR),OK,(char*)ESP8266_BUF,2000);

		    temp = strstr((char*)ESP8266_BUF,"STAIP,\"");

		   while(temp[i+7] != '"')
		    {
		  	Self_IP[i] = temp[i+7];
		  	i++;
		    }
	     }
		else
		 {
		  GLOBAL_RETURN = 1;
		  WIFI_status.WIFI_CONNECTED_TO_SSID = 0;
		 }
	   }
	  }

    BUF_clear(ESP8266_BUF,0,ESP8266_BUF_SIZE);
    BUF_clear(CMD_temp,0,CMD_temp_SIZE);

		return GLOBAL_RETURN;
}

uint8_t WIFI_AUTOCONNECT(char* dat)//????????
{
  char data[20] = {"AT+CWAUTOCONN="};
  strcat(data,dat);
  strcat(data,"\r\n");

  if(ESP8266_send(data,strlen(data),OK,ESP8266_BUF,100) == 0)
   {
    GLOBAL_RETURN = 0;
   }
  else
   {
	GLOBAL_RETURN = 1;
   }

  return GLOBAL_RETURN;
}

int8_t READ_WIFI_CONNECTION(char* data, uint16_t timing)//!!
{

  char temp[4] = {0};

  if(ESP8266_DMA_send((char*)ASK_CWJAP_CUR,strlen(ASK_CWJAP_CUR),"OK",(char*)ESP8266_BUF,timing) == 0)
   {
	if(strstr((char*)ESP8266_BUF,"No AP") != 0)
	 {
	  GLOBAL_RETURN = 1;
	  goto END;
	 }

	if(strstr((char*)ESP8266_BUF,data) != 0)
	 {
	  GLOBAL_RETURN = 0;

	  char* START = strstr((char*)ESP8266_BUF,"-");
	  char* END   = strstr(START,"\r");

	  memcpy(temp,START,END-START);
      RSSI_Power = atoi(temp);

	  goto END;
	 }
   }


 END:
 BUF_clear(ESP8266_BUF,0,ESP8266_BUF_SIZE);
 BUF_clear(CMD_temp,0,CMD_temp_SIZE);

 return GLOBAL_RETURN;
}

