Oleksii742/stm/GSM/Core/Src/ESP8266DRV07.c
int8_t Auto_Connect()//!!
{

  if(WIFI_CONNECT_CUR(Seting.Network,Seting.Password,10000) > -1)///////////////////////////////////////
   {
    if(WIFI_status.WIFI_CONNECTED_TO_SSID == 1)
     {
    	GLOBAL_RETURN = 0;
    	goto END;
     }

    if(WIFI_status.WIFI_CONNECTED_TO_SSID == 0)
     {
    	GLOBAL_RETURN = 1;
     }
   }

   END:

 return GLOBAL_RETURN;
}

uint8_t READ_WIFI_STATUS()
{
  ESP8266_send("AT+CIPSTATUS\r\n",14,"OK",ESP8266_BUF,2000);

  char* tem;
  uint8_t i = 0;
  char Status[2] = {0};

  tem = strstr(ESP8266_BUF,"STATUS:");

  if(tem != 0)
   {
   while(tem[i+7] != '\r')
	{
	 Status[i] = tem[i+7];
	 i++;
	}
   }
  else
   {
	    BUF_clear(ESP8266_BUF,'*',1024);
	return -1;
   }

    if(strcmp(Status,"2") == 0)//������� ESP8266 ���������� � ����� �������, � �� ������������ IP �����;
	 {
        BUF_clear(ESP8266_BUF,'*',1024);
	  GLOBAL_RETURN = 2;
	 }

	if(strcmp(Status,"3") == 0)//� ������� ESP8266 ���� ��������� TCP ��� UDP ����������;
	 {
	    BUF_clear(ESP8266_BUF,'*',1024);
	  GLOBAL_RETURN = 3;
	 }

	if(strcmp(Status,"4") == 0)//TCP ��� UDP �������� ������� ESP8266 ���������;
	 {
	    BUF_clear(ESP8266_BUF,'*',1024);
	  GLOBAL_RETURN = 4;
	 }

	if(strcmp(Status,"5") == 0)//������� ESP8266 �� ���������� � ����� �������;
	 {
	    BUF_clear(ESP8266_BUF,'*',1024);
	  GLOBAL_RETURN = 5;
	 }

	return GLOBAL_RETURN;
}

char* READ_ALL_NETWORK_SSID(char* RETURN)
{
	BUF_clear(ESP8266_BUF,0,ESP8266_BUF_SIZE);

	WIFI_READ_ALL_SSID(RETURN,5000);

	uint8_t SSID_COUNT = 0;

	char* SSID_TEMP[10] = {0};

	SSID_TEMP[0] = strstr((char*)RETURN,"(");
	SSID_COUNT++;

	if(SSID_TEMP[0] != 0)
	 {
	  for(uint8_t i = 1; i < 10; i++)
	   {
		SSID_TEMP[i] = strstr(SSID_TEMP[i-1]+1,"(");

		if(SSID_TEMP[i] != 0)
		 {
		  SSID_COUNT++;
		 }
	   }

	  char SSID_RSSI[SSID_COUNT][80];
	  memset(SSID_RSSI,0,SSID_COUNT*80);

	  for(uint8_t i = 0; i < SSID_COUNT; i++)
	   {
		  char ECN[2] = {0};
		  char BGN[2] = {0};

		  char* START_SSID = strstr(SSID_TEMP[i],"\"")+1;
		  char* END_SSID   = strstr(START_SSID,"\"");
		  char* START_RSSI = strstr(END_SSID,"-");
		  char* END_RSSI   = strstr(START_RSSI,",");
		  char* MAC_START  = strstr(END_RSSI,"\"")+1;
		  char* MAC_END    = strstr(MAC_START,"\"");
		  char* ECN_START  = strstr(SSID_TEMP[i],"(")+1;
		  char* ECN_END    = strstr(ECN_START,",");
		  char* BGN_START  = strstr(MAC_END,")")- 3;

		  memcpy(BGN,BGN_START,1);

		  strcat(SSID_RSSI[i],"*#");
		  memcpy(SSID_RSSI[i]+strlen(SSID_RSSI[i]) ,START_SSID,END_SSID - START_SSID);
		  strcat(SSID_RSSI[i],";");
		  memcpy(SSID_RSSI[i]+strlen(SSID_RSSI[i]) ,START_RSSI,END_RSSI - START_RSSI);
		  strcat(SSID_RSSI[i],";");
		  memcpy(SSID_RSSI[i]+strlen(SSID_RSSI[i]) ,MAC_START,MAC_END - MAC_START);
		  strcat(SSID_RSSI[i],";");

		  memcpy(ECN,ECN_START,ECN_END - ECN_START);

		  switch(atoi(ECN))
		   {
			case 0:
			 strcat(SSID_RSSI[i],"OPEN");
			break;

			case 1:
			 strcat(SSID_RSSI[i],"WEP");
			break;

			case 2:
			 strcat(SSID_RSSI[i],"WPA_PSK");
			break;

			case 3:
			 strcat(SSID_RSSI[i],"WPA2_PSK");
			break;

			case 4:
			 strcat(SSID_RSSI[i],"WPA_WPA2_PSK");
			break;

			case 5:
			 strcat(SSID_RSSI[i],"WPA2_Enterprise");
			break;
		   }

		  strcat(SSID_RSSI[i],";");

		  if(atoi(BGN) & 0x01)
		   {
			strcat(SSID_RSSI[i],"b");
		   }

		  if(atoi(BGN) & 0x02)
		   {
			strcat(SSID_RSSI[i],"g");
		   }

		  if(atoi(BGN) & 0x04)
		   {
			strcat(SSID_RSSI[i],"n");
		   }


		   strcat(SSID_RSSI[i],"#*");
	   }

	  memset(RETURN,0,strlen(RETURN));

	  for(uint8_t i = 0; i < SSID_COUNT; i++)
	   {
	    memcpy(RETURN,SSID_RSSI[i],strlen(SSID_RSSI[i]));
	   }
	 }
	return RETURN;
}

void WIFI_READ_ALL_SSID(char* ANSWER, uint32_t count)//!!
{
   ESP8266_DMA_send("AT+CWLAP\r\n",12,OK,ANSWER,count);
}

uint8_t ESP8266_HOSTNAME(char* Name)
{
  char CMD[50] = {0};

  strcat(CMD,"AT+CWHOSTNAME=");
  strcat(CMD,"\"");
  strcat(CMD,Name);
  strcat(CMD,"\"");
  strcat(CMD,"\r\n");

  GLOBAL_RETURN = ESP8266_DMA_send(CMD,strlen(CMD),OK,ESP8266_BUF,2000);

  BUF_clear(ESP8266_BUF,0,ESP8266_BUF_SIZE);

  return GLOBAL_RETURN;
}



/////////////////////////////////////////////////////END_ESP_WIFI///////////////////////////////////////


/////////////////////////////////////////////////////ESP_BROADCAST//////////////////////////////////////

uint8_t WIFI_BROADCAST_Config()
 {
  WIFI_status.WIFI_mode = ESP_WIFI_MODE_SET(MODE_STA,1000); // MODE
  WIFI_status.WIFI_cip = WIFI_CIP(WIFI_CIP_OFF,1000);//WIFI_CIP
  WIFI_status.WIFI_mux = ESP_MUX(WIFI_MUX_ON,1000); //MUX
  WIFI_status.WIFI_server = ESP_SERVER_ON(WIFI_BROADCAST_PORT,1000); //SERVER_ON

  if(WIFI_status.WIFI_mode + WIFI_status.WIFI_cip + WIFI_status.WIFI_mux + WIFI_status.WIFI_server == 0)
   {
	GLOBAL_RETURN = 0;
   }
  else
   {
	GLOBAL_RETURN = 1;
   }

  return GLOBAL_RETURN;
 }

uint8_t WIFI_BROADCAST_PORT_START(char* Link, char* PORT)
     {
      strcat(CMD_temp,"AT+CIPSTART=");
      strcat(CMD_temp,Link);
      strcat(CMD_temp,",\"UDP\",\"0\",0,");
      strcat(CMD_temp,PORT);
      strcat(CMD_temp,",2\r\n");

      if(ESP8266_DMA_send(CMD_temp,strlen(CMD_temp),OK,ESP8266_BUF,1000) == 0)
       {
    	  WIFI_status.WIFI_BROADCAST_PORT_START = 0;
    	  GLOBAL_RETURN = 0;
       }
      else
       {
    	  WIFI_status.WIFI_BROADCAST_PORT_START = 1;
    	  GLOBAL_RETURN = 1;
       }

      BUF_clear(ESP8266_BUF,0,ESP8266_BUF_SIZE);
      BUF_clear(CMD_temp,0,CMD_temp_SIZE);

      return GLOBAL_RETURN;
     }

uint8_t WIFI_SEND_TO_BROADCAST(const char* IP, const char* port, const char* dat, uint16_t size, const char* Answer, char *Link)//!!
{
	if(WIFI_status.WIFI_CONNECTED_TO_SSID == 1)
	 {
	     char ito_temp[4] = {0};

	     BUF_clear(ESP8266_BUF,0,ESP8266_BUF_SIZE);

	     memset(ito_temp,0,4);
	     itoa(size,ito_temp,10);

	     strcat(CMD_temp,"AT+CIPSEND=");
	     strcat(CMD_temp+11,Link);
		 strcat(CMD_temp+12,",");
		 strcat(CMD_temp,ito_temp);
		 strcat(CMD_temp,"\r\n");

	     ESP8266_DMA_send(CMD_temp,strlen(CMD_temp),">",ESP8266_BUF,2000);
	     //HAL_Delay(2);
	     BUF_clear(ESP8266_BUF,0,ESP8266_BUF_SIZE);
	     //HAL_Delay(2);
	     ESP8266_DMA_send((char*)dat,size,"SEND OK",ESP8266_BUF,2000);
	 }

    BUF_clear(ESP8266_BUF,0,ESP8266_BUF_SIZE);
    BUF_clear(CMD_temp,0,CMD_temp_SIZE);

