Oleksii742/stm/GSM/Core/Src/ESP8266DRV07.c
     return 0;
}

uint8_t READ_BROADCAST()
{
	  char *temp = strstr(ESP8266_BUF,"+IPD");

	  if(strstr(ESP8266_BUF,"+IPD") != 0)
	   {
	    WIFI_ID[0] = temp[5];
	   }

	  else
	   {
		  goto FINISH;
	   }

	  Mod_Bus(strstr(ESP8266_BUF,":")+1);



	  FINISH:
	  BUF_clear(ESP8266_BUF, 0, ESP8266_BUF_SIZE);
	  return 0;
}

void WIFI_PARSING()
 {
	 if(WIFI_READ_COUNT >= 10)
	  {
		HAL_Delay(10);

		if(WIFI_MODE == 0)
		 {

		  if(strstr(ESP8266_BUF+5,"DISCONNECT") != 0)
		   {
			 WIFI_status.WIFI_CONNECTED_TO_SSID = 0;
			 BUF_clear(ESP8266_BUF,0,ESP8266_BUF_SIZE);
			 LL_TIM_EnableCounter(TIM4);
			// HAL_GPIO_WritePin(WIFI_OK_GPIO_Port, WIFI_OK_Pin, GPIO_PIN_RESET);
		   }

		  if(strstr(ESP8266_BUF+5,"CONNECTED") != 0)
		   {
			 WIFI_status.WIFI_CONNECTED_TO_SSID = 1;

			 READ_WIFI_CONNECTION(Seting.Network,2000);

			 ESP8266_DMA_send("AT+CIFSR\r\n",10,"OK",(char*)ESP8266_BUF,2000);

			 memset(Self_IP,0,17);
			 char* temp_start = strstr((char*)ESP8266_BUF,"\"")+1;
			 char* temp_end   = strstr(temp_start,"\"");
			 memcpy(Self_IP,temp_start,temp_end - temp_start);
			 BUF_clear(ESP8266_BUF,0,ESP8266_BUF_SIZE);
			 LL_TIM_DisableCounter(TIM4);
			// HAL_GPIO_WritePin(WIFI_OK_GPIO_Port, WIFI_OK_Pin, GPIO_PIN_SET);
		   }

		  if(WIFI_status.WIFI_CONNECTED_TO_SSID == 1)
		   {
			READ_BROADCAST();
		   }
		 }

		else
		 {
			WIFI_AP_READ();
		 }
	  }
 }

void WIFI_MODE_SELECT()
{
	/*     if(HAL_GPIO_ReadPin(WIFI_BUTTON_GPIO_Port, WIFI_BUTTON_Pin) == 0)
		  {
		   MAX7219_Send_CMD(0x0C,0x01);//ON
		   LL_TIM_EnableCounter(TIM3);
		   LED_ON_OFF_count = LED_ON_OFF_TIME;

	       HAL_Delay(3000);

	       if(WIFI_MODE == 0)
	        {
	        if(HAL_GPIO_ReadPin(WIFI_BUTTON_GPIO_Port, WIFI_BUTTON_Pin) == 0)
	       	  {
	    	   HAL_Delay(200);

	    	   LL_TIM_DisableCounter(TIM4);
	    	   LL_TIM_SetAutoReload(TIM4, 100);
	    	   LL_TIM_SetCounter(TIM4, 0);
	    	   LL_TIM_ClearFlag_UPDATE(TIM4);
	    	   LL_TIM_EnableIT_UPDATE(TIM4);
	    	   LL_TIM_EnableCounter(TIM4);

	    	   HAL_Delay(1000);

	    	   WIFI_RESET_HARD(500);

	    	     if(ESP_AT() == 0)
	    	      {
	    	    	 ESP_FACTORY_RESET();
	    	         WIFI_AP_init(MODE_APSTA, DHCP_APSTA_ON, WIFI_CIP_OFF, WIFI_MUX_ON, "80", 5000);
	    	         WIFI_MODE = 1;

	    	      }
	       	  }
		    }
	      else
	      {
	       if(HAL_GPIO_ReadPin(WIFI_BUTTON_GPIO_Port, WIFI_BUTTON_Pin) == 0)
	    	{
	    	 HAL_Delay(600);

	         if(HAL_GPIO_ReadPin(WIFI_BUTTON_GPIO_Port, WIFI_BUTTON_Pin) == 0)
	          {
	           HAL_Delay(200);

	    	   LL_TIM_DisableCounter(TIM4);
	    	   LL_TIM_SetAutoReload(TIM4, 500);
	    	   LL_TIM_SetCounter(TIM4, 0);
	    	   LL_TIM_ClearFlag_UPDATE(TIM4);
	    	   LL_TIM_EnableIT_UPDATE(TIM4);
	    	   LL_TIM_EnableCounter(TIM4);

	    	   HAL_Delay(1000);

	           WIFI_RESET_HARD(500);

	          	     if(ESP_AT() == 0)
	          	      {
	          	    	if(WIFI_BROADCAST_Config() == 0)
	          	    	 {
	          	    	          if(Auto_Connect() == 0)
	          	    	           {
	          	    	            WIFI_BROADCAST_PORT_START(WIFI_BROADCAST_LINK,WIFI_BROADCAST_PORT);
	          	    				LL_TIM_DisableCounter(TIM4);
	          	    				HAL_GPIO_WritePin(WIFI_OK_GPIO_Port, WIFI_OK_Pin, GPIO_PIN_SET);
	          	    	           }
	          	    	         }
	          	      }
	          }
	    	}
	        WIFI_MODE = 0;
	       }
		  }
*/}

/////////////////////////////////////////////////////END_ESP_BROADCAST//////////////////////////////////



/////////////////////////////////////////////////////OTHER//////////////////////////////////////////////

/*uint8_t WIFI_SEND_string(const char* dat, const char* Answer, char *Link)//!!
{
	char ito_temp[4] = {0};

	ESP_TEMP_clear();

	memset(ito_temp,0,4);
	itoa(strlen(dat),ito_temp,10);
	strcat(CMD_temp,"AT+CIPSEND=");
	strcat(CMD_temp,Link);
	strcat(CMD_temp,",");
	strcat(CMD_temp,ito_temp);
	strcat(CMD_temp,"\r\n");

	ESP8266_DMA_send(CMD_temp,strlen(CMD_temp),">",ESP8266_BUF,2000);

	ESP_BUF_clear();
	HAL_Delay(2);

	  if(ESP8266_DMA_send((char*)dat,strlen(dat),"SEND OK",ESP8266_BUF,2000) == 0)
	   {
         GLOBAL_RETURN = 0;
	   }
	  else
	   {
		  GLOBAL_RETURN = 1;
	   }

	  ESP_BUF_clear();
	  ESP_TEMP_clear();

    return GLOBAL_RETURN;
}*/

int8_t GET_TIME()
{
	char tem[5] = {0};
	char TIME[] = "AT+CIPSNTPTIME?\r\n";

	ESP_BUF_clear();

	ESP8266_DMA_send((char*)NTP,strlen(NTP),OK,ESP8266_BUF,1000);
	ESP_BUF_clear();
	HAL_Delay(500);
	ESP8266_DMA_send(TIME,strlen(TIME),OK,ESP8266_BUF,2000);
	HAL_Delay(500);

	if(strstr(ESP8266_BUF,"1970") != 0)
	 {
		 HAL_Delay(1000);
		 ESP8266_DMA_send((char*)NTP,strlen(NTP),OK,ESP8266_BUF,1000);
		 ESP_BUF_clear();
		 HAL_Delay(200);
		 ESP8266_DMA_send(TIME,strlen(TIME),OK,ESP8266_BUF,2000);


	    if(strstr(ESP8266_BUF,"1970") != 0)
	     {
	      HAL_Delay(1000);
	      ESP8266_DMA_send((char*)NTP,strlen(NTP),"OK",ESP8266_BUF,1000);
	      ESP_BUF_clear();
		  HAL_Delay(200);
		  ESP8266_DMA_send(TIME,strlen(TIME),"OK",ESP8266_BUF,2000);
	     }

	    if(strstr(ESP8266_BUF,"1970") != 0)
	     {
	      HAL_Delay(1000);
	      ESP8266_DMA_send((char*)NTP,strlen(NTP),"OK",ESP8266_BUF,1000);
	      ESP_BUF_clear();
		  HAL_Delay(200);
		  ESP8266_DMA_send(TIME,strlen(TIME),"OK",ESP8266_BUF,2000);
	     }

	    if(strstr(ESP8266_BUF,"1970") != 0)
	     {
	      HAL_Delay(1000);
	      ESP8266_DMA_send((char*)NTP,strlen(NTP),"OK",ESP8266_BUF,1000);
	      ESP_BUF_clear();
		  HAL_Delay(200);
		  ESP8266_DMA_send(TIME,strlen(TIME),"OK",ESP8266_BUF,2000);
	     }
	 }

	if(strstr(ESP8266_BUF,"1970") == 0)
	 {
	   uint8_t i = 0;
	   char* temp = strstr(ESP8266_BUF,"CIPSNTPTIME:");

       while(temp[i+16] != ' ')//' '
        {
    	 tem[i] = temp[i+16];
    	 i++;

    	 if(i > 5)
    	  {
           goto END;
    	  }
        }
         if((strstr(tem,"Jan") != 0)) tm.tm_mon = 1;
         if((strstr(tem,"Feb") != 0)) tm.tm_mon = 2;
         if((strstr(tem,"Mar") != 0)) tm.tm_mon = 3;
         if((strstr(tem,"Apr") != 0)) tm.tm_mon = 4;
         if((strstr(tem,"May") != 0)) tm.tm_mon = 5;
         if((strstr(tem,"Jun") != 0)) tm.tm_mon = 6;
         if((strstr(tem,"Jul") != 0)) tm.tm_mon = 7;
         if((strstr(tem,"Aug") != 0)) tm.tm_mon = 8;
         if((strstr(tem,"Sep") != 0)) tm.tm_mon = 9;
         if((strstr(tem,"Oct") != 0)) tm.tm_mon = 10;
         if((strstr(tem,"Nov") != 0)) tm.tm_mon = 11;
         if((strstr(tem,"Dec") != 0)) tm.tm_mon = 12;

         i = 0;
         memset(tem,'\0',5);

       while(temp[i+20] != ' ')
	    {
		 tem[i] = temp[i+20];
		 i++;

