Oleksii742/stm/GSM/Core/Src/ESP8266DRV07.c
    	 if(i > 5)
    	  {
    		 goto END;
    	  }
		}

         tm.tm_wday = atoi(tem);
         i = 0;
         memset(tem,'\0',5);

        while(temp[i+23] != ':')
		 {
		  tem[i] = temp[i+23];
		  i++;

		 if(i > 5)
		  {
			 goto END;
		  }
		 }

         tm.tm_hour = atoi(tem);
		 i = 0;
		 memset(tem,'\0',5);

	   while(temp[i+26] != ':')
		{
		 tem[i] = temp[i+26];
		 i++;

    	 if(i > 5)
    	  {
    		 goto END;
    	  }
		}

		tm.tm_min = atoi(tem);
		i = 0;
		memset(tem,'\0',5);

	   while(temp[i+29] != ' ')
		{
		 tem[i] = temp[i+29];
		 i++;

    	 if(i > 5)
    	  {
    		 goto END;
    	  }
		}

		tm.tm_sec = atoi(tem);
		i = 0;
		memset(tem,'\0',5);

	   while(temp[i+32] != '\n')
		{
		 tem[i] = temp[i+32];
		 i++;

    	 if(i > 5)
    	  {
    		 goto END;
    	  }
		}

		tm.tm_year = (atoi(tem));
		i = 0;
		memset(tem,'\0',5);

		ESP_BUF_clear();

		return 0;

	}

	END:
	return -1;
}

uint16_t PING(char addr[])//!!
{
 uint8_t i = 0;
 char PING_time[4] = {0};

 char dat[64]= {'\0'};
 strcat(dat,"AT+PING=");
 strcat(dat,"\"");
 strcat(dat,addr);
 strcat(dat,"\"");
 strcat(dat,"\r\n");

 ESP_BUF_clear();

 if(ESP8266_DMA_send(dat,sizeof(dat),OK,ESP8266_BUF,3000) == 0)
  {
	 GLOBAL_RETURN = 0;

	 char* tem;
	 tem = strstr(ESP8266_BUF+10,"+");

	  while(tem[i+1] != '\r')
	   {
		PING_time[i] = tem[i+1];
		i++;
	   }

      PING_TIME = atoi(PING_time);
  }
 else
  {
	 GLOBAL_RETURN = 1;
  }

 ESP_BUF_clear();
 return GLOBAL_RETURN;
}

uint8_t FLASH_WriteSettings(uint16_t PAGE)
{
	Seting.RW_KEY += 1;

    int Page_ADDR = 0x08000000 + (PAGE*1024);
	uint32_t  PAGE_ERR = 0;
	uint32_t*  source_addr = (void *)&Seting;
	uint32_t*  dest_addr = (uint32_t*)Page_ADDR;
	uint16_t  SETING_WORDS = (sizeof(Seting)/4);

	FLASH_EraseInitTypeDef EraseInitStruct;

	EraseInitStruct.TypeErase = FLASH_TYPEERASE_PAGES;
	EraseInitStruct.NbPages = 1;
	EraseInitStruct.PageAddress = (1024*PAGE) + 0x08000000;

	HAL_FLASH_Unlock();
	HAL_FLASHEx_Erase(&EraseInitStruct, &PAGE_ERR);

	for(uint16_t i = 0; i < SETING_WORDS; i++)
	 {
	  HAL_FLASH_Program(FLASH_TYPEPROGRAM_WORD, (uint32_t)dest_addr, (uint32_t)*source_addr);
	  source_addr++;
	  dest_addr++;
	 }
	return HAL_FLASH_Lock();
}

uint8_t FLASH_ReadSettings(uint16_t PAGE)
{
	    int Page_ADDR = 0x08000000 + (PAGE*1024);

	    uint32_t *source_addr = (uint32_t *)Page_ADDR;
	    uint32_t *dest_addr = (void *)&Seting;

	    for (uint16_t i=0; i<sizeof(Seting); i+=4)
	    {
	      *dest_addr = *(__IO uint32_t*)source_addr;
	      source_addr++;
	      dest_addr++;
	    }
	    return 0;
}
